Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/include/pic32cx1025mtsh128.h
#define IFLASH1_SIZE                   _UINT32_(0x00080000)    /*  512kB Memory segment type: flash */
#define IFLASH1_PAGE_SIZE              _UINT32_(       512)
#define IFLASH1_NB_OF_PAGES            _UINT32_(      1024)

#define CPKCC_ROM_SIZE                 _UINT32_(0x00010000)    /*   64kB Memory segment type: other */
#define CPKCC_RAM_SIZE                 _UINT32_(0x00001000)    /*    4kB Memory segment type: other */
#define QSPI_MEM_SIZE                  _UINT32_(0x02000000)    /* 32768kB Memory segment type: other */
#define QSPI_AESB_SIZE                 _UINT32_(0x02000000)    /* 32768kB Memory segment type: other */
#define IFLASH0_CC_SIZE                _UINT32_(0x00080000)    /*  512kB Memory segment type: flash */
#define IFLASH0_CC_PAGE_SIZE           _UINT32_(       512)
#define IFLASH0_CC_NB_OF_PAGES         _UINT32_(      1024)

#define IFLASH1_CC_SIZE                _UINT32_(0x00080000)    /*  512kB Memory segment type: flash */
#define IFLASH1_CC_PAGE_SIZE           _UINT32_(       512)
#define IFLASH1_CC_NB_OF_PAGES         _UINT32_(      1024)

#define QSPI_MEM_CC_SIZE               _UINT32_(0x02000000)    /* 32768kB Memory segment type: other */
#define QSPI_AESB_CC_SIZE              _UINT32_(0x02000000)    /* 32768kB Memory segment type: other */
#define DTCM_SIZE                      _UINT32_(0x00002000)    /*    8kB Memory segment type: other */
#define ITCM_SIZE                      _UINT32_(0x00004000)    /*   16kB Memory segment type: other */
#define IRAM0_SIZE                     _UINT32_(0x00040000)    /*  256kB Memory segment type: ram */
#define IRAM1_SIZE                     _UINT32_(0x00008000)    /*   32kB Memory segment type: ram */
#define IRAM2_SIZE                     _UINT32_(0x00004000)    /*   16kB Memory segment type: ram */
#define CORTEXM_PRIVATE_PB_SIZE        _UINT32_(0x00100000)    /* 1024kB Memory segment type: other */

#define PERIPHERALS_ADDR               _UINT32_(0x40000000)    /* PERIPHERALS base address (type: io)*/
#define IFLASH0_ADDR                   _UINT32_(0x01000000)    /* IFLASH0 base address (type: flash)*/
#define IFLASH1_ADDR                   _UINT32_(0x01080000)    /* IFLASH1 base address (type: flash)*/
#define CPKCC_ROM_ADDR                 _UINT32_(0x02020000)    /* CPKCC_ROM base address (type: other)*/
#define CPKCC_RAM_ADDR                 _UINT32_(0x02031000)    /* CPKCC_RAM base address (type: other)*/
#define QSPI_MEM_ADDR                  _UINT32_(0x04000000)    /* QSPI_MEM base address (type: other)*/
#define QSPI_AESB_ADDR                 _UINT32_(0x06000000)    /* QSPI_AESB base address (type: other)*/
#define IFLASH0_CC_ADDR                _UINT32_(0x11000000)    /* IFLASH0_CC base address (type: flash)*/
#define IFLASH1_CC_ADDR                _UINT32_(0x11080000)    /* IFLASH1_CC base address (type: flash)*/
#define QSPI_MEM_CC_ADDR               _UINT32_(0x14000000)    /* QSPI_MEM_CC base address (type: other)*/
#define QSPI_AESB_CC_ADDR              _UINT32_(0x16000000)    /* QSPI_AESB_CC base address (type: other)*/
#define DTCM_ADDR                      _UINT32_(0x1fffa000)    /* DTCM base address (type: other)*/
#define ITCM_ADDR                      _UINT32_(0x1fffc000)    /* ITCM base address (type: other)*/
#define IRAM0_ADDR                     _UINT32_(0x20000000)    /* IRAM0 base address (type: ram)*/
#define IRAM1_ADDR                     _UINT32_(0x20080000)    /* IRAM1 base address (type: ram)*/
#define IRAM2_ADDR                     _UINT32_(0x20088000)    /* IRAM2 base address (type: ram)*/
#define CORTEXM_PRIVATE_PB_ADDR        _UINT32_(0xe0000000)    /* CORTEXM_PRIVATE_PB base address (type: other)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR PIC32CX1025MTSH128                                 */
/* ************************************************************************** */
#define CHIP_JTAGID                    _UINT32_(0X05B4503F)
#define CHIP_CIDR                      _UINT32_(0X2C3D0CE0)
#define CHIP_EXID                      _UINT32_(0X00000000)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR PIC32CX1025MTSH128                            */
/* ************************************************************************** */



#ifdef __cplusplus
}
#endif

#endif /* _PIC32CX1025MTSH128_H_ */

